Revit 2027 API
ExportLineweightInfo(String) Constructor
 Constructs a new ExportLineweightInfo using the destination line weight name as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLineweightInfo(
	string destinationLineweightName
)
Public Sub New (
	destinationLineweightName As String
)
public:
ExportLineweightInfo(
	String^ destinationLineweightName
)
new :
        destinationLineweightName : string -> ExportLineweightInfo
Parameters
destinationLineweightName String
 The destination line weight name (the name of the line weight in the exported format).
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLineweightInfo Class
ExportLineweightInfo Overload
Autodesk.Revit.DB Namespace